In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import datetime as dt

In [2]:
data = pd.read_csv("booking_train_set.csv", index_col=0)
data.shape

(1166835, 9)

In [3]:
data.head(10)

,user_id,checkin,checkout,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id
0,1006220,2016-04-09,2016-04-11,31114,desktop,384,Gondal,Gondal,1006220_1
1,1006220,2016-04-11,2016-04-12,39641,desktop,384,Gondal,Gondal,1006220_1
2,1006220,2016-04-12,2016-04-16,20232,desktop,384,Gondal,Glubbdubdrib,1006220_1
3,1006220,2016-04-16,2016-04-17,24144,desktop,384,Gondal,Gondal,1006220_1
4,1010293,2016-07-09,2016-07-10,5325,mobile,359,The Devilfire Empire,Cobra Island,1010293_1
5,1010293,2016-07-10,2016-07-11,55,mobile,359,The Devilfire Empire,Cobra Island,1010293_1
6,1010293,2016-07-12,2016-07-13,23921,mobile,359,The Devilfire Empire,Cobra Island,1010293_1
7,1010293,2016-07-13,2016-07-15,65322,desktop,9924,The Devilfire Empire,Cobra Island,1010293_1
8,1010293,2016-07-15,2016-07-16,23921,desktop,9924,The Devilfire Empire,Cobra Island,1010293_1
9,1010293,2016-07-16,2016-07-17,20545,desktop,10573,The Devilfire Empire,Cobra Island,1010293_1

In [4]:
data.tail()

,user_id,checkin,checkout,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id
1166830,999261,2016-09-13,2016-09-15,14197,tablet,10332,Gondal,Fook Island,999261_1
1166831,999755,2016-12-13,2016-12-16,4476,desktop,2661,The Devilfire Empire,Gondal,999755_1
1166832,999755,2016-12-16,2016-12-17,1034,desktop,7974,The Devilfire Empire,Gondal,999755_1
1166833,999755,2016-12-22,2016-12-25,64876,desktop,7974,The Devilfire Empire,Fook Island,999755_1
1166834,999755,2016-12-25,2016-12-28,9608,desktop,9924,The Devilfire Empire,Fook Island,999755_1

In [5]:
data.columns

Index(['user_id', 'checkin', 'checkout', 'city_id', 'device_class',
       'affiliate_id', 'booker_country', 'hotel_country', 'utrip_id'],
      dtype='object')

In [6]:
#Find columns with Nans 
print("Columns with missing value: ")
print(data.columns[data.isnull().any()].tolist())

Columns with missing value:
[]

In [7]:
print(data.isnull().sum())

user_id           0
checkin           0
checkout          0
city_id           0
device_class      0
affiliate_id      0
booker_country    0
hotel_country     0
utrip_id          0
dtype: int64

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1166835 entries, 0 to 1166834
Data columns (total 9 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   user_id         1166835 non-null  int64
 1   checkin         1166835 non-null  object
 2   checkout        1166835 non-null  object
 3   city_id         1166835 non-null  int64
 4   device_class    1166835 non-null  object
 5   affiliate_id    1166835 non-null  int64
 6   booker_country  1166835 non-null  object
 7   hotel_country   1166835 non-null  object
 8   utrip_id        1166835 non-null  object
dtypes: int64(3), object(6)
memory usage: 89.0+ MB

In [9]:
print("Unique Vaue Count: ")
cols = data.columns.tolist()
for col in cols:
    print(col+ " = " + str(len(data[col].unique())))

Unique Vaue Count:
user_id = 200153
checkin = 425
checkout = 425
city_id = 39901
device_class = 3
affiliate_id = 3254
booker_country = 5
hotel_country = 195
utrip_id = 217686

In [10]:
data.describe()

            user_id       city_id  affiliate_id
count  1.166835e+06  1.166835e+06  1.166835e+06
mean   3.129535e+06  3.347059e+04  5.719503e+03
std    1.808045e+06  1.958255e+04  3.964435e+03
min    2.900000e+01  2.000000e+00  5.000000e+00
25%    1.562185e+06  1.701300e+04  9.340000e+02
50%    3.126222e+06  3.228200e+04  6.309000e+03
75%    4.701432e+06  5.112800e+04  9.924000e+03
max    6.258087e+06  6.756500e+04  1.069700e+04

In [11]:
data.loc[data['utrip_id'] == '999755_1']  #So. they visited two different cities in Gondal and another two in Fook Island since city_id is different and so are the check in and check out dates.

,user_id,checkin,checkout,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id
1166831,999755,2016-12-13,2016-12-16,4476,desktop,2661,The Devilfire Empire,Gondal,999755_1
1166832,999755,2016-12-16,2016-12-17,1034,desktop,7974,The Devilfire Empire,Gondal,999755_1
1166833,999755,2016-12-22,2016-12-25,64876,desktop,7974,The Devilfire Empire,Fook Island,999755_1
1166834,999755,2016-12-25,2016-12-28,9608,desktop,9924,The Devilfire Empire,Fook Island,999755_1

In [12]:
#print ('Current date/time: {}'.format(dt.now()))
checkin = pd.to_datetime(data['checkin'],format='%Y-%m-%d')
checkout = pd.to_datetime(data['checkout'],format='%Y-%m-%d')

data['duration'] = checkout - checkin
#data['month'] = pd.to_datetime(data['checkout'],format='%m')
#data['year'] = pd.to_datetime(data['checkout'],format='%Y')

data.head(10)

,user_id,checkin,checkout,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id,duration
0,1006220,2016-04-09,2016-04-11,31114,desktop,384,Gondal,Gondal,1006220_1,2 days
1,1006220,2016-04-11,2016-04-12,39641,desktop,384,Gondal,Gondal,1006220_1,1 days
2,1006220,2016-04-12,2016-04-16,20232,desktop,384,Gondal,Glubbdubdrib,1006220_1,4 days
3,1006220,2016-04-16,2016-04-17,24144,desktop,384,Gondal,Gondal,1006220_1,1 days
4,1010293,2016-07-09,2016-07-10,5325,mobile,359,The Devilfire Empire,Cobra Island,1010293_1,1 days
5,1010293,2016-07-10,2016-07-11,55,mobile,359,The Devilfire Empire,Cobra Island,1010293_1,1 days
6,1010293,2016-07-12,2016-07-13,23921,mobile,359,The Devilfire Empire,Cobra Island,1010293_1,1 days
7,1010293,2016-07-13,2016-07-15,65322,desktop,9924,The Devilfire Empire,Cobra Island,1010293_1,2 days
8,1010293,2016-07-15,2016-07-16,23921,desktop,9924,The Devilfire Empire,Cobra Island,1010293_1,1 days
9,1010293,2016-07-16,2016-07-17,20545,desktop,10573,The Devilfire Empire,Cobra Island,1010293_1,1 days

In [17]:
##Local tourists
localData = data.loc[data['hotel_country']==data['booker_country']]
localData.head(20)

,user_id,checkin,checkout,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id,duration
0,1006220,2016-04-09,2016-04-11,31114,desktop,384,Gondal,Gondal,1006220_1,2 days
1,1006220,2016-04-11,2016-04-12,39641,desktop,384,Gondal,Gondal,1006220_1,1 days
3,1006220,2016-04-16,2016-04-17,24144,desktop,384,Gondal,Gondal,1006220_1,1 days
37,1047687,2016-08-21,2016-08-22,67353,mobile,8132,Elbonia,Elbonia,1047687_3,1 days
38,1047687,2016-08-22,2016-08-23,14145,mobile,8132,Elbonia,Elbonia,1047687_3,1 days
39,1047687,2016-08-23,2016-08-24,11531,mobile,8132,Elbonia,Elbonia,1047687_3,1 days
40,1047687,2016-08-24,2016-08-25,57167,mobile,9924,Elbonia,Elbonia,1047687_3,1 days
41,1047687,2016-08-25,2016-08-26,29770,mobile,9924,Elbonia,Elbonia,1047687_3,1 days
57,106415,2016-05-10,2016-05-11,36063,mobile,5755,Gondal,Gondal,106415_10,1 days
58,106415,2016-05-11,2016-05-12,36063,mobile,9598,Gondal,Gondal,106415_10,1 days
59,106415,2016-05-12,2016-05-13,36063,mobile,9598,Gondal,Gondal,106415_10,1 days
60,106415,2016-05-13,2016-05-14,36063,mobile,9598,Gondal,Gondal,106415_10,1 days
61,106415,2016-05-14,2016-05-15,36063,mobile,9598,Gondal,Gondal,106415_10,1 days
62,106415,2016-05-15,2016-05-16,36063,mobile,9598,Gondal,Gondal,106415_10,1 days
63,106415,2016-05-16,2016-05-17,36063,mobile,9598,Gondal,Gondal,106415_10,1 days
95,1118748,2016-08-12,2016-08-13,49412,desktop,9924,Elbonia,Elbonia,1118748_1,1 days
137,1182903,2016-11-22,2016-11-23,35990,mobile,4503,Gondal,Gondal,1182903_2,1 days
243,1318264,2016-12-11,2016-12-12,5085,mobile,9924,Gondal,Gondal,1318264_11,1 days
244,1318264,2016-12-12,2016-12-13,1034,mobile,9924,Gondal,Gondal,1318264_11,1 days
245,1318264,2016-12-13,2016-12-14,19425,mobile,9924,Gondal,Gondal,1318264_11,1 days

In [24]:
localData.shape

(111890, 10)

In [13]:
#non local tourists
nonLocalData = data.loc[data['hotel_country']!=data['booker_country']]
nonLocalData.head(10)

,user_id,checkin,checkout,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id,duration
2,1006220,2016-04-12,2016-04-16,20232,desktop,384,Gondal,Glubbdubdrib,1006220_1,4 days
4,1010293,2016-07-09,2016-07-10,5325,mobile,359,The Devilfire Empire,Cobra Island,1010293_1,1 days
5,1010293,2016-07-10,2016-07-11,55,mobile,359,The Devilfire Empire,Cobra Island,1010293_1,1 days
6,1010293,2016-07-12,2016-07-13,23921,mobile,359,The Devilfire Empire,Cobra Island,1010293_1,1 days
7,1010293,2016-07-13,2016-07-15,65322,desktop,9924,The Devilfire Empire,Cobra Island,1010293_1,2 days
8,1010293,2016-07-15,2016-07-16,23921,desktop,9924,The Devilfire Empire,Cobra Island,1010293_1,1 days
9,1010293,2016-07-16,2016-07-17,20545,desktop,10573,The Devilfire Empire,Cobra Island,1010293_1,1 days
10,1012680,2016-10-23,2016-10-25,37709,desktop,384,Gondal,Yerba,1012680_1,2 days
11,1012680,2016-10-25,2016-10-27,11837,desktop,384,Gondal,Panem,1012680_1,2 days
12,1012680,2016-10-27,2016-10-30,19626,desktop,384,Gondal,Yerba,1012680_1,3 days

In [14]:
data.groupby(data['hotel_country']==data['booker_country']).count()  ## total no. of entries: 1166835 (true+false)
                                                                     ##True: no. local tourists entries: 111890
                                                                     ##False: non -local tourists entries: 1054945

,user_id,checkin,checkout,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id,duration
False,1054945,1054945,1054945,1054945,1054945,1054945,1054945,1054945,1054945,1054945
True,111890,111890,111890,111890,111890,111890,111890,111890,111890,111890

In [15]:
data.groupby(['utrip_id']).count()   ##unique or no. of multi destination trips = 217686 or no. of unique users

,user_id,checkin,checkout,city_id,device_class,affiliate_id,booker_country,hotel_country,duration
utrip_id,,,,,,,,,
1000027_1,4,4,4,4,4,4,4,4,4
1000033_1,5,5,5,5,5,5,5,5,5
1000045_1,7,7,7,7,7,7,7,7,7
1000083_1,4,4,4,4,4,4,4,4,4
100008_1,5,5,5,5,5,5,5,5,5
...,...,...,...,...,...,...,...,...,...
999776_1,4,4,4,4,4,4,4,4,4
999839_1,4,4,4,4,4,4,4,4,4
999842_1,4,4,4,4,4,4,4,4,4
999855_1,15,15,15,15,15,15,15,15,15
999944_1,4,4,4,4,4,4,4,4,4

In [18]:
#local tourists unique ids: unique no of trips
#local =pd.DataFrame()
local = localData['utrip_id'].unique()
#local
local_df = pd.DataFrame(local,columns=['utrip_id'])
local_df.head(10)

     utrip_id
0   1006220_1
1   1047687_3
2   106415_10
3   1118748_1
4   1182903_2
5  1318264_11
6    133917_7
7    136586_1
8   1483553_1
9   1505696_2

In [19]:
local_df.shape

(33920, 1)

In [20]:
####LOCAL TOURISTS####
localData['booker_country'].value_counts()    #local tourists mostly Gondal is the country and least from Tcherkistan

Gondal                  77574
Elbonia                 22972
The Devilfire Empire     4005
Bartovia                 3888
Tcherkistan              3451
Name: booker_country, dtype: int64

In [21]:
localData['city_id'].value_counts()   ##most visited city id 36063

36063    3694
44869    1147
58178    1028
44320     999
29770     986
         ...
352         1
2401        1
10597       1
57724       1
28686       1
Name: city_id, Length: 9807, dtype: int64

In [29]:
#non local tourists unique ids: unique no of trips
non_local = nonLocalData['utrip_id'].unique()
#non_local
nonlocal_df = pd.DataFrame(non_local,columns=['utrip_id'])
nonlocal_df.head(10)

    utrip_id
0  1006220_1
1  1010293_1
2  1012680_1
3  1017326_1
4  1024544_2
5   103011_1
6  1032262_2
7   103327_1
8  1057628_1
9  1062443_1

In [30]:
nonlocal_df.shape

(199976, 1)

In [45]:
###NON LOCAL
nonLocalData['city_id'].value_counts()   ##most visited city id 47499

47499    11242
23921    10511
17013     9011
29319     8179
64876     7784
         ...
51692        1
57833        1
35300        1
41441        1
2049         1
Name: city_id, Length: 34788, dtype: int64

In [47]:
nonLocalData['hotel_country'].value_counts()   ##tourists mostly stayed at Cobra Island

Cobra Island    137791
Fook Island     117717
Glubbdubdrib     74840
Borginia         45629
Kangan           44876
                 ...
Buenaventura         1
Sardovia             1
Maltovia             1
Rhelasia             1
Nuevo Rico           1
Name: hotel_country, Length: 195, dtype: int64

In [49]:
nonLocalData['booker_country'].value_counts()   ##tourists mostly booked from Gondal

Gondal                  458462
The Devilfire Empire    282239
Elbonia                 212372
Tcherkistan              77122
Bartovia                 24750
Name: booker_country, dtype: int64